{
  "version": "1.0.0",
  "name": "UI Potion",
  "description": "AI-agent-optimized UI component guides for any framework",
  "baseUrl": "https://uipotion.com",
  "discovery": {
    "manifestUrl": "https://uipotion.com/uipotion-manifest.json",
    "potionsIndexUrl": "https://uipotion.com/potions-index.json"
  },
  "usage": {
    "how_to_use": "AI agents can discover and load component guides by referencing this manifest. Each potion (component guide) is framework-agnostic and provides detailed specifications for implementation.",
    "workflow": [
      "1. Agent loads this manifest to discover available potions",
      "2. Agent browses potions-index.json to find relevant component",
      "3. Agent loads specific potion JSON guide (e.g., layouts/dashboard.json)",
      "4. Agent detects the project's framework and styling system by examining package.json, existing components, config files, and style imports",
      "5. Agent adapts the guide to the detected framework and styling system, using ONLY what's already in the project",
      "6. Agent implements the component based on detailed specifications, following outputConstraints and matching existing project patterns"
    ],
    "stylingEnforcement": "Agents MUST detect the project's framework (React, Vue, Angular, Svelte) and styling system (Tailwind, SCSS, CSS, styled-components, etc.) BEFORE writing code. Use ONLY the detected styling system - if Tailwind is configured, use Tailwind; if SCSS, use SCSS; if nothing is configured, use the most suitable CSS approach. Match existing component patterns exactly. Do NOT introduce new styling systems or ad-hoc CSS. If detection is uncertain, ask the user about their styling approach and framework."
  },
  "categories": [
    {
      "id": "layouts",
      "name": "Layouts",
      "description": "Full-page layouts and structural patterns (dashboards, landing pages, documentation layouts)"
    },
    {
      "id": "components",
      "name": "Components",
      "description": "Reusable UI building blocks (buttons, dialogs, cards, forms, navigation, data tables, feedback, media players, animations)"
    },
    {
      "id": "features",
      "name": "Features",
      "description": "Complete user-facing features and flows (pricing tables, authentication flows, e-commerce, onboarding, search, user profiles)"
    },
    {
      "id": "patterns",
      "name": "Patterns",
      "description": "Design and interaction patterns (drag-and-drop, infinite scroll, progressive disclosure, accessibility patterns, keyboard navigation, responsive patterns)"
    },
    {
      "id": "tooling",
      "name": "Tooling",
      "description": "Developer tools and infrastructure (build tools, CLI utilities, third-party integrations, API patterns, performance optimization, testing strategies, deployment configs)"
    }
  ],
  "meta": {
    "created": "2026-01-10",
    "updated": "2026-02-03",
    "license": "MIT",
    "legalUrl": "https://uipotion.com/legal.html",
    "copyrightScope": "Full disclaimer and terms: https://uipotion.com/legal.html",
    "legalDisclaimer": "Specifications only; we do not generate code. Full terms and liability disclaimer: https://uipotion.com/legal.html"
  }
}
